contact.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

      <link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
      <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css" />
</head>
<body>
<header id="" class="status">

              <nav>
                  <a href="/">Home</a>
                  <a href="/contact.html">Contact me</a>
                  <a href="/Notes/">Notes</a>
                  <a href="/Projects/">Projects</a>
              </nav>
              <h1></h1>
</header>
<main id="" class="content">
<p>
<a href="mailto:anthony@anthonychavez.xyz">anthony@anthonychavez.xyz</a>
</p>

<div id="outline-container-org156e186" class="outline-2">
<h2 id="org156e186">Sending me Encrypted emails</h2>
<div class="outline-text-2" id="text-org156e186">
<p>
If you want to send me encrypted emails, you can find my public gpg key
and fingerprint below. You can copy my public key or download <code>anthonychavez.key</code> linked further down.
</p>

<p>
You can then import my key with:
</p>
<div class="org-src-container">
<pre class="src src-sh">gpg --import anthonychavez.key
</pre>
</div>
<p>
or whatever you named the file.
</p>

<p>
We'll have to exchange public keys. Export your public key with:
</p>
<div class="org-src-container">
<pre class="src src-sh">gpg --export -a -o yourname.key you@email.com
</pre>
</div>

<p>
Or generate a public and private key pair if you don't already have them.
</p>
<div class="org-src-container">
<pre class="src src-sh">gpg --full-gen-key
</pre>
</div>
</div>

<div id="outline-container-orga6a7504" class="outline-3">
<h3 id="orga6a7504">GPG KEY</h3>
<div class="outline-text-3" id="text-orga6a7504">
<p>
<a href="anthonychavez.key">anthonychavez.key</a>
</p>
<pre>
-----BEGIN PGP PUBLIC KEY BLOCK-----

mQENBFqIpu4BCADWn8iEB+3u+G/6+oDbVfgdpiaegOFPfyNcH0hAbGMzjoA6dMzs
8fz7Q5IFcDGbDEj1PRHHEOuIIgb1yVH1/CApCpz1d5Z5EszQUzNI28+Jj94f/I4o
1iqrJlcI2n1h5N7g+sSkwJbxB5hjkmQ8OyidrZhxPlooFdf8wC7/AOQ5oEryKs7R
qEkewPhOQugbZOwMp9jc8XPH/vIrPk1YhOwF6cza/FHVgrAsZq9nLmujX2I2YXnh
W29RV+9+hQytNt2yxf6/oT9FndDfYCMdYcIWTd2SDZV6dHWzhlqjilDTmChBbJV+
IF4tX7IipDNJcwhG81FVpVDK3mnKZq/dohQ3ABEBAAG0KkFudGhvbnkgQ2hhdmV6
IDxhbnRob255QGFudGhvbnljaGF2ZXoueHl6PokBTgQTAQgAOBYhBOJpO8wYhLTJ
Dp5bHUVrjJrspXrSBQJaiKbuAhsDBQsJCAcCBhUKCQgLAgQWAgMBAh4BAheAAAoJ
EEVrjJrspXrSsvUIAIP5aODVtf/q/bGJBRoWGM2WG4yAVI1D5T12Aw07Pm3MDX1N
ygyWLrGSiKYcx7Dga32HQ/Yp1CwZbsOjQAH4iazKL1ZEGgoT/Plka6PfiwOQ9X3V
WPBnC41yMlBR5btA9AJFMS9LEreF6cee4UticmVGMnpmIHt8FSkJSyH9QyJZYMQr
mpPSUVgy1PdYefP89/+1cn7Gk7F2nNrm9zsRCJTo6Gje5oZ3Iue2j9sinMPiVn7F
jrxM3NloEAYZhDfYdySFhBTLAPhjzEUMDL/rjp+FeLPTcjHjpY7ijf41YPe4EqyV
IUV2KqMClgfy045+YDFd+a5IbrHmJCiDf/pZHvy5AQ0EWoim7gEIAMTIEvL7FH84
0PhwxE0L3NpnFLBYs7xtGm7D86qgTDv7kKm4Orjd8thn1y2kH947SJoVuQ6oNwJs
uOvmlU/PFhvXl1gwwVMV2Sqso8i9/7fRLGjUIZ5jCTL6vRg0XtC0CQqljGN9PfUk
xtIxGKhd3sBiJhxwDu8kyGwreZyFOP0Yu+MuTJRWMKfAtO6dZxxCBo759bQEdsH4
6QpQytDIN3NrETZ/OrPu0KllgpaCLRLwXY9BrHbkXha+qri04CNmJb8M08BAMoPV
Sc67GveVhczKQ7vX1jDVqAz090CriLOo/6k5XwAapcAN93BAWSYpZlis0cdJHDfp
5kc8Gib9fOMAEQEAAYkBNgQYAQgAIBYhBOJpO8wYhLTJDp5bHUVrjJrspXrSBQJa
iKbuAhsMAAoJEEVrjJrspXrSSmIH/R8NWTbXM0jOnWqiZ+nl1dufjSJmz06bVtHi
Umhid0vP/3Qjb3p9/+tP8/YU65pMSgshZLOKlmeo5N5Wa4hJynYDQOZe3nhE/wwb
CCUcVzuLS3+7fLqOqWcwoSN9rWLvfXRIZVg2flXY1E4XK41f3XPR+fwovGAptGsn
147vHQotqyoKqAXn19gcKcbo2fHaORAtdFWcDoCgiLwuo6aPZcsdWlD4xcGxRSen
7veOrekpWsxgLPpETkFedEfOlRAg40a/oLjFq5iAQnZRe1c98GJjxn1/Z7vj3/0w
6kmfL/aSwwAueWqoKBBaY3mcl6SHBXAxOHqbRlSsuZfhUKcoTDg=
=2TNd
-----END PGP PUBLIC KEY BLOCK-----
</pre>
</div>
<div id="outline-container-org8701451" class="outline-4">
<h4 id="org8701451">GPG fingerprint</h4>
<div class="outline-text-4" id="text-org8701451">
<pre>
E269 3BCC 1884 B4C9 0E9E 5B1D 456B 8C9A ECA5 7AD2
</pre>
</div>
</div>
</div>
</div>
</main>
<footer id="" class="status">

              Created with: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)
</footer>
</body>
</html>
